/*
    بخش های اصلی در ریداکس :
    1.Actions : توابعی که برای اعمال تغییر در استیت های داخل استور توسط کامپوننت ها اجرا می شوند

        action => 
            ACTION_TYPE = نوع عمل رو نشان می دهد که به صورت یک مقدار رشته ای می باشد => "PRODUCTS_GET_ALL" 
            payload => داده ای که همراه اکشن ارسال می شود 
              => type : "PRODUCT_DELETE", payload : 101 (productId)
              => type : "PRODUCT_ADD", payload: {productName:'test', categoryId:12, price:1400}

            * dispatch => توسط این تابع می توانیم اکشن ها را فراخوانی کنیم

    2.Reducers : کلاس یا تابعی که اکشن های اجرا شده را دریافت می کنند و براساس نوع اکشن و مقدار ارسالی 
    داخل آن بر روی استیت های داخل استور تغییر ایجاد می کنند
        * reducer => setState
        ** هر reducer => در داخل استور یک متغیر با نام مشخص شده دارد


    3.Store


*/